# Pandas --->
#it is an open source library of python tht is used to handle.   #data manipulations

In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.0-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.0-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ------------- -------------------------- 3.7/11.0 MB 26.8 MB/s eta 0:00:01
   ---------------------------- ----------- 7.9/11.0 MB 25.2 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 21.6 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.0 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:

# Data structure of pandas
# a. Series ---> it is one dimensional array and it shows only values
# b. DataFrame ---> it is two dimensional array and it shows values in rows
# and columns

In [4]:
a = pd.Series([1,45,78,90])
a

0     1
1    45
2    78
3    90
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

# data frame

In [13]:
a = {
    'Emp_id' : [1,2,3,4,5],
    'Name' : ["Sam", "Rahul", "Mohit", "Aniket", "pallavi"],
    'Dept' : ["HR", "IT", "HR", "IT", "HR"],
    'Working hrs':[8,9,8,9,8],
    'Salary' : [10000, 20000, 30000, 40000, 50000]
 }

type(a)

dict

In [12]:
df = pd.DataFrame(a)
df

   Emp_id     Name Dept  Working hrs  Salary
0       1      Sam   HR            8   10000
1       2    Rahul   IT            9   20000
2       3    Mohit   HR            8   30000
3       4   Aniket   IT            9   40000
4       5  pallavi   HR            8   50000

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df.to_csv("C:\\Users\\user\\Desktop\\dat\\emp_data.csv")

In [16]:
df.to_csv("C:\\Users\\user\\Desktop\\dat\\emp_data.csv",index=False)

# import data

In [17]:
df = pd.read_csv("C:\\Users\\user\\Desktop\\dat\\emp_data.csv")

In [18]:
df

   Emp_id     Name Dept  Working hrs  Salary
0       1      Sam   HR            8   10000
1       2    Rahul   IT            9   20000
2       3    Mohit   HR            8   30000
3       4   Aniket   IT            9   40000
4       5  pallavi   HR            8   50000

In [3]:
import pandas as pd

In [7]:
a = {
    'stu_id' : [1,2,3,4,5],
    'Name' : ["yash", "Rahul", "Mohit", "Aniket", "pallavi"],
    'course' : ["ba", "bTtech", "ba", "IT", "bsc"],
    'age':[21,22,19,20,21],
}

In [8]:
df= pd.DataFrame(a)
df

   stu_id     Name  course  age
0       1     yash      ba   21
1       2    Rahul  bTtech   22
2       3    Mohit      ba   19
3       4   Aniket      IT   20
4       5  pallavi     bsc   21

In [9]:
df.to_csv("C:\\Users\\user\\Desktop\\dat\\stu_data.csv",index=False)

In [10]:
df = pd.read_csv("C:\\Users\\user\\Desktop\\dat\\stu_data.csv")
df

   stu_id     Name  course  age
0       1     yash      ba   21
1       2    Rahul  bTtech   22
2       3    Mohit      ba   19
3       4   Aniket      IT   20
4       5  pallavi     bsc   21